<a href="https://colab.research.google.com/github/hoangcuongnguyen2001/Income-Analysis/blob/main/Income_analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Import dataset**

In [40]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings 
warnings.filterwarnings("ignore")

df = pd.read_csv('https://raw.githubusercontent.com/hoangcuongnguyen2001/Income-Analysis/main/Income_Analysis/adult.csv')
df.head()

   age workclass  fnlwgt  ... hours.per.week  native.country income
0   90         ?   77053  ...             40   United-States  <=50K
1   82   Private  132870  ...             18   United-States  <=50K
2   66         ?  186061  ...             40   United-States  <=50K
3   54   Private  140359  ...             40   United-States  <=50K
4   41   Private  264663  ...             40   United-States  <=50K

[5 rows x 15 columns]

**Finding data types for all columns**

In [34]:
df.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education.num      int64
marital.status    object
occupation        object
relationship      object
race              object
sex               object
capital.gain       int64
capital.loss       int64
hours.per.week     int64
native.country    object
income            object
dtype: object

**Finding missing values on analysis**

In [35]:
df[df=='?']=np.nan
df.head()

   age workclass  fnlwgt  ... hours.per.week  native.country income
0   90       NaN   77053  ...             40   United-States  <=50K
1   82   Private  132870  ...             18   United-States  <=50K
2   66       NaN  186061  ...             40   United-States  <=50K
3   54   Private  140359  ...             40   United-States  <=50K
4   41   Private  264663  ...             40   United-States  <=50K

[5 rows x 15 columns]

In [36]:
df.isnull().sum()

age                  0
workclass         1836
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week       0
native.country     583
income               0
dtype: int64

In [37]:
null_columns =['workclass','occupation','native.country']
for i in null_columns:
    df.fillna(df[i].mode()[0], inplace=True)

In [38]:
df.head()

   age workclass  fnlwgt  ... hours.per.week  native.country income
0   90   Private   77053  ...             40   United-States  <=50K
1   82   Private  132870  ...             18   United-States  <=50K
2   66   Private  186061  ...             40   United-States  <=50K
3   54   Private  140359  ...             40   United-States  <=50K
4   41   Private  264663  ...             40   United-States  <=50K

[5 rows x 15 columns]

**Exploratory Data Analysis**

In [14]:
df.nunique()

age                  73
workclass             9
fnlwgt            21648
education            16
education.num        16
marital.status        7
occupation           15
relationship          6
race                  5
sex                   2
capital.gain        119
capital.loss         92
hours.per.week       94
native.country       42
income                2
dtype: int64

**Encode dependent variable**

In [31]:

df.shape
df['income'].value_counts()

0    24720
1     7841
Name: income, dtype: int64

In [39]:
#Create a checkpoint
df=df.copy()

cleanup_income = {"income":     {"<=50K": 0, ">50K": 1}}

df = df.replace(cleanup_income)
df.head()

   age workclass  fnlwgt  ... hours.per.week  native.country income
0   90   Private   77053  ...             40   United-States      0
1   82   Private  132870  ...             18   United-States      0
2   66   Private  186061  ...             40   United-States      0
3   54   Private  140359  ...             40   United-States      0
4   41   Private  264663  ...             40   United-States      0

[5 rows x 15 columns]

In [30]:
df['income'].value_counts()

0    24720
1     7841
Name: income, dtype: int64

count       32561
unique          9
top       Private
freq        22696
Name: workclass, dtype: object